Repository: SiegeEngineers/aoe2cm
Catalog: locale/*/LC_MESSAGES/aoe2cm.po
Languages: hu_hu

source: Orthodoxy (monks +3/+3 armor), Druzhina (infantry do 5 damage to adjecent enemy units)
hu_hu: Orotodoxia (papok +3/+3 pajzs), Druzsina (gyalogság 5 taposó támadást kap)

source: Military buildings provide +5 population
hu_hu: Katonai épületek +5 szállást biztosítanak

source: Inquisition (monks convert faster), Supremacy (Villager combat attributes increased)
hu_hu: Inkvizíció (papok gyorsabban hittérítenek), Fennhatóság (Parasztok hadi tulajdonsági jobbak)

source: Town Centers garrison +10 units, shoot +5 arrows
hu_hu: Városközpontok +10 egységet fogadnak be, +5 nyilat lőnek

source: Ironclad (siege weapons +4/+0 armor), Crenellations (+3 Castle range; garrisoned infantry fire arrows)
hu_hu: Pancélos (ostromgépek +4/+0 pajzs), Bástya (+3 lőtáv; szállásolt gyalogság is lő nyilakat)

source: Sipahi (Cavalry archers +20HP), Artillery (+2 range Bombard Towers, Bombard Cannons, Cannon Galleons)
hu_hu: Sipahi (Lovasíjászok +20 HP), Tüzérség (+2 lőtáv Ágyús tornyoknak, Ágyúsoknak és ágyús hajóknak)

source: Warships cost -10% in Feudal, -15% in Castle, -20% in Imperial Age
hu_hu: Hadihajók olcsóbbak -10%-al Feudális, -15%-al Kastély és -20%-al Imperiális Korban

source: Chieftains (Berserks +5 attack vs cavalry), Berserkergang (Berserks regenerate faster)
hu_hu: Törzsfőnökök (Berszerkerek +5 támadás lovasság ellen), Vadbanda (Berszerkek gyorsabban regenerálódnak)

source: Docks cost -15%
hu_hu: Kikötök -15%-al olcsóbbak

source: Player
hu_hu: Játékos

source: None
hu_hu: Semmi

source: Action
hu_hu: Művelet

source: Hidden
hu_hu: Rejtett

source: Civilization
hu_hu: Civilizáció

source: Start
hu_hu: Indít

source: End
hu_hu: Vége

source: Error updating the draft state.
hu_hu: Hiba az aktualizálásnál.

source: Error sending ready.
hu_hu: Hiba készenlét küldésénél.

source: Error starting draft.
hu_hu: Hiba a játék indításakor.

source: Error picking/banning civ.
hu_hu: Hiba a civilizáció választásánál/tiltásánál.

source: Error setting name.
hu_hu: Hiba a név beállításakor.

source: <span class='green-glow'><b>Pick</b></span> a civilization!
hu_hu: <span class='green-glow'><b>Válassz</b></span> egy civilizációt!

source: <span class='red-glow'><b>Ban</b></span> a civilization for the enemy!
hu_hu: <span class='red-glow'><b>Tilts meg</b></span> egy civilizációt!

source: Too late. Random pick.
hu_hu: Túl késő. Véletlenszerű jelölés.

source: Drafting ended.
hu_hu: Vége.

source: Please paste this code into in-game chat: {0} for spectating later.
hu_hu: A következő kódot: {0} másold a játék chatjébe, hogy később visszanézhető legyen.

source: Use this code: {0} to spectate later.
hu_hu: Későbbi visszanézéshez használd ezt a kódot: {0}.

source: Click {0} to let the host start the draft.
hu_hu: Klikk {0}, hogy a másik kapitány elindíthassa a játekot.

source: Ready
hu_hu: Kész

source: get ready!
hu_hu: készülj fel!

source: Waiting for the guest captain to get ready.
hu_hu: Várunk a vendég kapitányra, hogy felkészüljön.

source: Waiting for the host captain to start the draft.
hu_hu: Varunk a kezdő kapitányra, hogy elindítsa a besorozást.

source: Guest is ready.
hu_hu: Vendég készenlétben.

source: Send this code to spectators: {0}.
hu_hu: Küldd ezt a kódot a nézőknek {0}.

source: Click {0} to begin.
hu_hu: Indításhoz clickelj ide: {0}.

source: Starting draft in... {0}
hu_hu: A besorozás {0} belül indul.

source: Waiting for the other captain... {0}
hu_hu: Várunk a másik kapitányra... {0}

source: Starting spectating in... {0}
hu_hu: A visszanézés {0} belül indul.

source: Data connection issues.
hu_hu: Adat-forgalom problémák.

source: Captain
hu_hu: Kapitány

source: Picks
hu_hu: Jelöltek

source: Bans
hu_hu: Tiltott

source: Host Captain
hu_hu: Kezdő Kapitány

source: Guest Captain
hu_hu: Vendég Kapitány

source: Click to edit...
hu_hu: Klikkelj módosításhoz...

source: Conquerors
hu_hu: Hódítók

source: Forgotten
hu_hu: Elfedettek

source: Forgotten+African Kingdoms
hu_hu: Elfeledettek+Afrikai Királyok

source: Not started.
hu_hu: Nincs elstartolva.

source: Wrong turn number.
hu_hu: Rossz forduló szám.

source: Already past last turn.
hu_hu: Az utolsó kör után vagyunk.

source: It's the opponent's turn.
hu_hu: Ez az ellenfél köre.

source: No such civilization.
hu_hu: Nem létező civilizáció.

source: It's not your turn.
hu_hu: Ez nem a te köröd.

source: This pick/ban is not allowed.
hu_hu: A jelölés/tiltás nem engedélyezett.

source: pick
hu_hu: jelöl

source: ban
hu_hu: tilt

source: show picks
hu_hu: feltár jelölt

source: show bans
hu_hu: feltár tiltott

source: show
hu_hu: feltár

source: hide for pick
hu_hu: rejtsd el választásnál

source: hide for ban
hu_hu: rejtsd el tiltásnál

source: hide civ
hu_hu: rejts el a civilizációt

source: global pick
hu_hu: globális választás

source: global ban
hu_hu: globális tiltás

source: exclusive pick
hu_hu: Exkluzív választás

source: exclusive ban
hu_hu: Exkluzív tiltás

source: reveal all
hu_hu: mindet mutat

source: disable pick
hu_hu: elérhetetlen választani

source: disable ban
hu_hu: elérhetetlenné tesz tiltáshoz

source: disable completely
hu_hu: teljesen elérhetetlen

source: There was an error sending a choice to the server.
hu_hu: Hiba történt a választás küldésénél.

source: There was an error changing aoe version.
hu_hu: Hiba AoE verzió váltásnál.

source: Cancel
hu_hu: Töröl

source: Done
hu_hu: Kész

source: Admin turns
hu_hu: Admin művelet

source: User turns
hu_hu: Felhasználó fordulók

source: Logout
hu_hu: Kijelentkezés

source: Maintenance
hu_hu: Karbantartás

source: New preset
hu_hu: Új beállítás

source: Name
hu_hu: Név

source: Enabled
hu_hu: Engedélyezett

source: Actions
hu_hu: Műveletek

source: true
hu_hu: igaz

source: false
hu_hu: hamis

source: enable
hu_hu: engedélyez

source: disable
hu_hu: elérhetetlen

source: New tournament
hu_hu: Új turné

source: Description
hu_hu: Leírás

source: Login
hu_hu: Bejelentkezés

source: Username
hu_hu: Felhasználónév

source: Password
hu_hu: Jelszó

source: Practice
hu_hu: Gyakorlás

source: Make sure you read this!
hu_hu: Mindenképpen olvasd ezt el!

source: In Practice mode You control both player's picks and bans.The page looks just as if you were the blue player. <b>BUT</b>, while the yellow player's choices are grayed out and there is no highlight, you can still pick and ban civs for him by clicking on the civ.
hu_hu: Gyakorló módban Te irányítod mindkét játékos választásaid és tiltásait. Az oldalt pont úgy néz ki, mintha a kék játékos volnál. <b>DE</b>, míg a sárga játékos választásai el vannak szürkítve, így is választhatsz és tilthatsz az ellenfél nevében, ha ráklikkelsz a civilizációra.

source: Created by %s.
hu_hu: Létrehozta %s.

source: For more AoC content visit:
hu_hu: További AoC tartalamért látogasd:

source: back
hu_hu: vissza

source: Click to set name...
hu_hu: Klikkelj névváltoztatáshoz...

source: Welcome
hu_hu: Üdvözöljük

source: Looks like it's your first time here. First, set a captain name for yourself:
hu_hu: Úgy néz ki először jársz itt. Először add be a nick nevedet:

source: You can edit this anytime in the future by clicking your name.
hu_hu: A jövőben ezt bármikor megváltoztathatod, ha ráklikkelsz a nevedre.

source: Set name
hu_hu: Név változtatás

source: Make sure you read the rules!
hu_hu: Mindenképpen olvasd el a szabályokat!

source: switch theme
hu_hu: válts témát

source: Host or Join
hu_hu: Besorozás

source: Spectate
hu_hu: Nézőtér

source: Captains mode is a turn-based civilization picker. Each captain can <span class='green-glow'>pick</span> and <span class='red-glow'>ban</span> civilizations in a predefined order. Bans prevent the opponent's captain from picking the civilizations.
hu_hu: Kapitány mód egy civilizáció választó rendszer. Mindkét kapitány <span class='green-glow'>kijelölhet</span> (a jelölt civilizációkat használja majd a játékban) és <span class='red-glow'>tilthat</span> civilizációkat megadott sorrendben. A tiltások megakadályozzák az ellenfél kapitányát, hogy az adott civilizációt válassza.

source: For each turn captains have <b>30 seconds</b>. In case of timeout a random civilization is picked for the captain or no civilization gets banned.
hu_hu: Mindkét kapitánynak <b>30 másodperc</b> áll rendelkezésére. Ennek leforgása után véletlenszerű választásra kerül sor vagy semmilyen civilizáció nem lesz blokkolva (tiltva).

source: There are also extension available for tournaments. <b>Hidden</b> option (black corners) hides the civilization choices until they are explicitely showed (visible in the timeline at the top). <b>Global</b> pick or bans disables the civilization for later turns. For other specific settings, please refer to the preset descriptions.
hu_hu: Léteznek további bővítmények turnékhoz. <b>Rejtett</b> választáskor (fekete sarkak) a választott jelölés vagy tiltás rejtve marad, míg nincsenek feltárva (külön forduló az időrendben az oldal tetején). <b>Globális</b> jelölés vagy tiltás megakadályozza az adott civilizáció választását a következő fordulóknál. További beállításokhoz, lásd a leírást a játékoknál.

source: <b>Practice</b> mode is for testing purposes, where both sides are controlled by a single player.
hu_hu: <b>Gyakorló</b> mód tesztelésre szolgál, amikor mindkét kapitányt egy játékos irányít.

source: Tournaments
hu_hu: Turnék

source: Use preset
hu_hu: Használj beállítást

source: Host draft
hu_hu: Tovább

source: Quick draft
hu_hu: Gyors besorozás

source: Join existing draft
hu_hu: Csatlakozz létező besorozáshoz

source: code:
hu_hu: kód:

source: Join
hu_hu: Csatlakozz

source: I have a code
hu_hu: Van kódom

source: Recent Drafts
hu_hu: Nemrégi sorozások

source: Watch
hu_hu: Követ

source: Watch Live
hu_hu: Élőben követ

source: Go to home page
hu_hu: Vissza a nyitólapra

source: Go back
hu_hu: Vissza

source: Please wait...
hu_hu: Kérjük várj...

source: Waiting for the other captain to join.
hu_hu: Várunk a másik kapitányra, hogy csatlakozzon.

source: Send <b>privately</b> this code:
hu_hu: Küldd el <b>privát</b> üzenetként ezt a kódot:

source: or url:
hu_hu: vagy url:

source: Waiting for captains to join. Send this code first to host then guest:
hu_hu: Várunk a kapitányokra. Küldd ezt a kódot először a kezdő játékosnak, majd a vendégnek:

source: Alternatively send this url to the host captian:
hu_hu: Alternatívaként küldd ezt az url a kezdő játékosnak

source: and this url to the guest captain:
hu_hu: és ezt az url-t a vendég kapitánynak

source: Error
hu_hu: Hiba

source: A network error occured, please try a new game.
hu_hu: Hálózati hiba történt, próbáljon új játékot.

source: This game was not finished due to network error or one of the users disconnecting.
hu_hu: A játék nem lett befejezve hálózati hiba miatt.

source: The other user disconnected.
hu_hu: Az ellenfél hálózata szétkapcsolt.

source: No such game found.
hu_hu: Nem létező besorozás.

source: play
hu_hu: játssz

source: pause
hu_hu: megszakít

source: next
hu_hu: következ²o

source: fast-forward
hu_hu: gyors-előre
