Repository: SiegeEngineers/aoe2cm
Catalog: locale/*/LC_MESSAGES/aoe2cm.po
Languages: hu_hu

source: Practice Opponent
hu_hu: Gyakorló Ellenfél

source: spectate
hu_hu: visszanéz

source: Host
hu_hu: Kezdő

source: Guest
hu_hu: Vendég

source: AoE2 Captains mode
hu_hu: AoE2 Kapitány mód

source: Captains mode
hu_hu: Kapitány mód

source: Unknown
hu_hu: Ismeretlen

source: Different meanings based on the situation.
hu_hu: Különböző jelentés a szituáció alapján.

source: Random civ - when you see this as badge, <br />it means one of the captains didn't pick in time and a random civilization was picked for him.
hu_hu: Véletlenszerűen választott civilizáció - amikor ezt a bélyeget látod, <br />azt jelenti, hogy valamelyik kapitány nem választott időben civilizációt <br /> és egy véletlenszerű civilizáció lett választva helyette.

source: No ban - when you see this as banned, <br />it means no civilization got banned
hu_hu: Semmilyen tiltás - amikor ez jelenik meg mint tiltott civilizáció, <br> semmilyen civilizáció nem lett tiltva az adott körben.

source: Aztecs
hu_hu: Azték

source: Infantry and Monk civilization
hu_hu: Gyalogság és Pap civilizáció

source: Villagers carry +5
hu_hu: Parasztok +5 anyagot szállítanak

source: Military units created 15% faster
hu_hu: Hadi egységek 15% gyorsabban vannak létrehozva

source: +5 Monk hit points for each Monastery technology
hu_hu: +5 HP papoknak minden befejezett pap technológiával

source: Loom free
hu_hu: Szövőszék ingyen

source: Jaguar Warrior
hu_hu: Jaguár harcos

source: Garland Wars(+4 infantry attack)
hu_hu: Virágfüzéres háború (+4 támadás gyalogos egységeknek)

source: Relics generate +33% gold
hu_hu: Relikviák 33% több aranyat generálnak

source: Britons
hu_hu: Brittek

source: Foot archer civilization
hu_hu: Gyalogos íjász civilizáció

source: Town Centers cost -50% wood upon reaching the Castle Age
hu_hu: Városközpontok 50% kevesebb fába kerülnek Kastély Kor után

source: Foot archers (excluding Skirmishers) have +1 range in Castle Age, <br /> +1 in Imperial Age (for +2 total)
hu_hu: Gyalogos íjászok (dárdavetőkön kívül) +1 hatótávolságúak Kastély Kortól <br /> és +1 Imperiális Kortól (+2 összesen)

source: Shepherds work 25% faster
hu_hu: Pásztorok 25% gyorsabban dolgoznak

source: Longbowman
hu_hu: Hosszúíjász

source: Yeomen (+1 Foot archer range; +2 tower attack)
hu_hu: Önkéntesek (+1 gyalog íjász lőtáv, +2 torony lőtáv)

source: Archery Ranges work 20% faster
hu_hu: Íjászat 20% gyorsabban dolgozik

source: Byzantines
hu_hu: Bizánciak

source: Defensive civilization
hu_hu: Defenzív civilizáció

source: Buildings have +10% HP in Dark Age, +20% HP in Feudal Age,<br /> +30% in Castle Age, +40% in Imperial Age.
hu_hu: Épületek +10% HP Korai Középkorban, +20% HP Feudális korban, +30% Kastély Korban, +40% Imperiális Korban

source: Counter units cost 25% less
hu_hu: Ellen-egységeg 25%-al olcsóbbak

source: Fire Ships attack 20% faster
hu_hu: Gyújtóhajók 20% gyorsabban támadnak

source: Imperial Age costs -33%
hu_hu: Imperiális Kor 33%-al olcsóbb

source: Town Watch is free
hu_hu: Toronyőr ingyenes

source: Cataphract
hu_hu: Kataphraktosz

source: Logistica (Cataphracts cause trample damage)
hu_hu: Logisztika (Kataphraktosz extra eltaposó támadás)

source: Monks +50% heal speed
hu_hu: Papok 50%-al gyorsabban gyógyítanak

source: Celts
hu_hu: Kelták

source: Infantry civilization
hu_hu: Gyalogság civilizáció

source: Infantry move 15% faster
hu_hu: Gyalogság 15% gyorsabban mozog

source: Lumberjacks work 15% faster
hu_hu: Favágók 15% gyorsabban dolgoznak

source: Siege weapons fire 20% faster
hu_hu: Ostromfegyverek 20% gyorsabban töltenek újra

source: Sheep cannot be stolen if within one Celt unit's line of sight
hu_hu: Bárányok nem lophatóak el, míg legalább egy Kelta egység látja

source: Woad Raider
hu_hu: Woad Fosztogató

source: Furor Celtica (Siege Workshop Units +50% HP)
hu_hu: Kelta extázis (Ostromgépek +50% HP)

source: Siege Workshops work 20% faster
hu_hu: Ostromgépműhelyek 20% gyorsabban dolgoznak

source: Chinese
hu_hu: Kínaiak

source: Archer civilization
hu_hu: Íjász civilizáció

source: Start game with 3 extra villagers but -50 Wood and -150 Food
hu_hu: 3 paraszttal többel, de -50 Fával és -150 Hússal kezdenek

source: Technologies cost -10% in Feudal Age, -15% in Castle Age,<br /> -20% in Imperial Age
hu_hu: Technológiák -10%-al Feudális Korban, -15%-al Kastély Korban, <br /> és -20%-al olcsóbb az Imperiális Korban

source: Town Centers support 10 population instead of 5
hu_hu: Városközpontok 10 hellyel többet biztosítanak

source: Demolition Ships have +50% HP
hu_hu: Robbantóhajóknak +50% HP-jük van

source: Chu Ko Nu
hu_hu: Csu Ko Nu

source: Rocketry (+2 Chu Ko Nu pierce attack, +4 scorpions)
hu_hu: Rakétatechnika (+2 szúrótámadás Chu Ko Nuknak, +4 szúrótámadás skorpiáknak

source: Farms provide +45 food
hu_hu: Farmok +45 ételt nyújtanak

source: Franks
hu_hu: Frankok

source: Cavalry civilization
hu_hu: Lovagsági civilizáció

source: Castles are 25% cheaper
hu_hu: Kastélyok 25%-al olcsóbbak

source: Knights have +20% HP
hu_hu: Lovagok +20% HP-t kapnak

source: Farm upgrades are free (Mill is required to receive bonus)
hu_hu: Farm technológiák ingyenesek (Malom szükséges)

source: Throwing Axeman
hu_hu: Fejszedobáló

source: Bearded Axe (+1 Throwing Axeman range)
hu_hu: Szakállas Fejsze (+1 lőtáv Fejszedobálóknak)

source: Knights have +2 line of sight
hu_hu: Lovagok +2-vel távolabb látnak

source: Goths
hu_hu: Gótok

source: Infantry cost 33% less (starting in Feudal Age)
hu_hu: Gyalogság 33%-al olcsóbb (Feudális Kortól kezdve)

source: Infantry have +1 attack against buildings
hu_hu: Gyalogságnak +1 támadása van épületek ellen

source: Villagers have +5 attack versus wild boar
hu_hu: Parasztok +5 támadást kapnak vaddisznók ellen

source: Hunters carry +15 meat
hu_hu: Vadászok +15 húst hordoznak

source: +10 to population limit in Imperial Age
hu_hu: +10 populáció korlát Imperiális korban

source: Huskarl
hu_hu: Huszkarl

source: Anarchy (Create Huskarls at Barracks),Perfusion (Barracks units created 50% faster)
hu_hu: Anarchia (Huszkarlok

source: Barracks operate 20% faster
hu_hu: Kaszárnya 20% gyorsabban dolgozik

source: Huns
hu_hu: Hunok

source: Houses are not required to support population, start game with -100 Wood
hu_hu: Nincs szükségüg házakra a népesség ellátására, de -100 Fával kezdenek

source: Cavalry Archers cost -25% in Castle Age, -30% in Imperial Age
hu_hu: Lovasíjászok -25%-al olcsóbbak Kastély Korban és -30%-al Imperiális Korban

source: Trebuchets are 35% more accurate
hu_hu: Trebuchék 35%-al pontosabbak

source: Tarkan
hu_hu: Tarkány

source: Atheism (+100 years Wonder/Relic victory time; -50% Spies/Treason cost)
hu_hu: Ateizmus (+100 év Csoda/Relikvia győzelem ideje, -50% Kém és Árulás ár)

source: Stables are 20% faster
hu_hu: Itállók 20%-al gyorsabbak

source: Japanese
hu_hu: Japánok

source: Fishing Ships have 2x HP and +2 armor
hu_hu: Halászhajóknak 2x több HP-jük és +2 védelmük van

source: Fishing Ships work +5% faster in Dark Age, +10% in Feudal Age, <br />+15% in Castle Age, +20% in Imperial Age
hu_hu: Halászhajók gyorsabban dolgoznak +5%-al Sötét Korban, +10%-al Feudális Korban, <br /> 15%-al Kastély korban és +20%-al Imperiális korban

source: Lumber Camps, Mining Camps, and Mills are 50% cheaper
hu_hu: Favágó Sátor, Bányászsátor és a Malom 50%-al olcsóbb

source: Infantry attack 25% faster (starting in Feudal Age)
hu_hu: Gyalogság 25%-al gyorsabban támad (Feudális kortól)

source: Samurai
hu_hu: Szamuráj

source: Kataparuto (Trebuchets fire, pack/unpack faster)
hu_hu: Kataparuto (Trebechetek gyorsabban töltenek újra és comagolnak szét és össze)

source: Galleys have +50% line of sight
hu_hu: Gályák +50% messzebb látnak

source: Koreans
hu_hu: Kóreaiak

source: Tower and naval civilization
hu_hu: Torony és tengerész civilizáció

source: Villagers have +3 line of sight
hu_hu: Parasztok +3-al tovább látnak

source: Stone miners work 20% faster
hu_hu: Kőbányászok 20%-al gyorsabban dolgoznak

source: Guard Tower and Keep upgrades are free
hu_hu: Őrtorony és Öregtorony technológiák ingyenesek

source: Towers (except bombard towers) have +1 range in Castle Age, +2 in Imperial Age
hu_hu: Tornyoknak (Ágyús tornyokat kivéve) +1 lőtávuk van Kastély Korban, +2 Imperiális Korban

source: War Wagon, Turtle Ship (Dock)
hu_hu: Hadi Szekér, Teknőshajó (Kikötő)

source: Shinkichon (+1 range Mangonels, Onagers)
hu_hu: Shinkicson (+1 lőtáv mangoneleknek és onagereknek)

source: Mangonel line has +1 range
hu_hu: Mangonel vonal +1 lőtáv

source: Mayans
hu_hu: Maják

source: Start with Eagle Warrior
hu_hu: Sasharcossal kezdenek

source: Start game with 1 extra villager, -50 Food
hu_hu: Eggyel több paraszttal kezdenek, de -50 Hússal

source: Natural resources last 20% longer
hu_hu: Természetes készletek 20%-al tovább tartanak

source: Archers cost -10% in Feudal Age, -20% in Castle Age, -30% in Imperial Age
hu_hu: Íjászok olcsóbbak -10%-al Feudális Korban, -20%-al Kastély Korban, -30%-al Imperiális Korban

source: Plumed Archer
hu_hu: Tollasíjász

source: El Dorado (+40 Eagle Warrior HP)
hu_hu: Eldorádó (+40 HP Sasharcosoknak)

source: Walls are 50% cheaper
hu_hu: Falak 50%-al olcsóbbak

source: Mongols
hu_hu: Mongolok

source: Cavalry Archer civilization
hu_hu: Lovasíjász civilizáció

source: Cavalry Archers fire 20% faster
hu_hu: Lovasíjászok 20%-al gyorsabban lőnek

source: Light Cavalry and Hussars have +30% HP
hu_hu: Könnyű lovagság és huszárok +30% HP

source: Hunters work 50% faster
hu_hu: Vadászok 50%-al gyorsabban dolgoznak

source: Drill (Siege Workshop units move 50% faster)
hu_hu: Fúró (Ostrom műhelyből való gépek 50%al gyorsabbak)

source: Scout line has +2 line of sight
hu_hu: Felderítő lovagság vonala +2-vel messzebb lát

source: Persians
hu_hu: Perzsák

source: Start game with +50 wood and food
hu_hu: +50 Fával és Hússal kezdenek

source: Town Center and Docks have 2x HP
hu_hu: Városközpontnak és Kikötőnek 2x több az HP-je

source: Town Centers and Docks operate +10% faster in Feudal Age, <br /> +15% in Castle Age, +20% in Imperial Age
hu_hu: Városközpont és Kikötő gyorsabban működik +10%-al Feudális Korban, <br /> +15%-al Kastély és +20%-al Imperiális Korban

source: War Elephant
hu_hu: Hadi Elefánt

source: Mahouts (+30% War Elephant speed)
hu_hu: Mahouts (+30%-al gyorsabb elefántok)

source: Knights have +2 attack versus Archers
hu_hu: Lovagoknak +2 támadása van íjászok ellen

source: Saracens
hu_hu: Szaracénok

source: Camel and Naval civilization
hu_hu: Teve és Tengerészeti civilizáció

source: Market trade cost is only 5%
hu_hu: Kereskedési adó csak 5%

source: Transport Ships have 2x HP and carry capacity
hu_hu: Szállítóhajónak 2x több az HP-je és kapacitása

source: Galleys attack 20% faster
hu_hu: Gályák 20%-al gyorsabban támadnak

source: Cavalry Archers have +4 attack against buildings
hu_hu: Lovasíjászoknak +4 támadása van épületek ellen

source: Mameluke
hu_hu: Mameluk

source: Zealotry (+30 camel, Mameluke HP)
hu_hu: Fanatizmus (+30 teve és mameluk HP)

source: Foot archers have +2 attack against buildings
hu_hu: Gyalogíjászoknak +2 támadása van épületek ellen

source: Spanish
hu_hu: Spanyolok

source: Gunpowder and Monk civilization
hu_hu: Lőpor és Papi civilizáció

source: Villagers construct buildings 30% faster
hu_hu: Parasztok 30%-al gyorsabban építenek

source: Blacksmith upgrades do not cost any gold
hu_hu: Kovács technológiák nem kerülnek aranyba

source: Cannon Galleons benefit from Ballistics (improved fire rate and accuracy)
hu_hu: Ágyús hajókra is hat a Ballisztika (gyorsabb támadás, pontosság)

source: Hand Cannoneers and Bombard Cannons fire 15% faster
hu_hu: Puskások és Ágyúsok 15%-al gyorsabban lőnek

source: Conquistador, Missionary
hu_hu: Hódítók, Misszionáriusok

source: Supremacy (Villager combat attributes increased)
hu_hu: Fennhatóság (Parasztok hadi tulajdonságai erősebbek)

source: Trade units generate +33%
hu_hu: Kereskedő egységek 33%-al többet termelnek

source: Teutons
hu_hu: Teutonok

source: Monks have 2x healing range
hu_hu: Papok gyógyítóereje 2x nagyobb hatótávolságú

source: Towers can garrison 2x units
hu_hu: Tornyok 2x több egységet szállásolnak el

source: Murder Holes is free
hu_hu: Gyiloklyuk ingyenes

source: Farms cost 33% less
hu_hu: Farmok 33%-al olcsóbbak

source: Town Centers have +2 attack and +5 line of sight
hu_hu: Városközpontok +2 támadást és +5 látótávot kapnak

source: Teutonic Knight
hu_hu: Teuton Lovag

source: Crenellations (+3 Castle range; garrisoned infantry fire arrows)
hu_hu: Bástya (+3 lőtáv; szállásolt gyalogság is lő nyilakat)

source: Units are more resistant to conversion
hu_hu: Egységek jobban ellenálnak a hittérítésnek

source: Turks
hu_hu: Törökök

source: Gunpowder civilization
hu_hu: Lőpor civilizáció

source: Gunpowder Units have +25% HP
hu_hu: Lőpor egységeg +25% HP

source: Gunpowder technologies cost 50% less
hu_hu: Lőpor technológiák 50%-al olcsóbbak

source: Chemistry is free
hu_hu: Kémia ingyenes

source: Gold miners work 15% faster
hu_hu: Aranybányászok 15%-al gyorsabban dolgoznak

source: Light Cavalry and Hussar upgrades are free
hu_hu: Könnyű-lovagság és Huszár technológiák ingyenesek

source: Janissary
hu_hu: Janicsár

source: Artillery (+2 range Bombard Towers, Bombard Cannons, Cannon Galleons)
hu_hu: Tüzérség (Ágyús tornyoknak, Ágyúknak és Ágyús hajóknak +2 lőtáv)

source: Gunpowder units are created 20% faster
hu_hu: Lőpor egységek 20%-al gyorsabban jönnek létre

source: Vikings
hu_hu: Vikingek

source: Infantry and naval civilization
hu_hu: Gyalogság és Tengerész civilizáció

source: Warships cost 25% less
hu_hu: Hadihajók -25%-al olcsóbbak

source: Infantry have +10% HP in Feudal Age, +15% in Castle Age, <br /> +20% in Imperial Age
hu_hu: Gyalogság Feudális Kortól +10% HP, Kastély Kortól +15% HP, <br /> Imperiális Kortól +20% HP

source: Wheelbarrow and Hand Cart are free
hu_hu: Talicska és Tolókocsi ingyenes

source: Berserker, Longboat (Dock)
hu_hu: Berszerk, Hosszúhajó (Kikötő)

source: Berserkergang (Berserks regenerate faster)
hu_hu: Vadbanda (Berszerkerek gyorsabban regenerálódnak)

source: Docks are 25% cheaper
hu_hu: Kikötők 25%-al olcsóbbak

source: Start with +50 gold
hu_hu: +50 Arannyal kezdenek

source: Atlatl(skirmishers +1 range, +1 pierce attack),Garland Wars(+4 infantry attack)
hu_hu: Atlatl (dárdavetők +1 lőtáv, +1 támadás), Virágfüzér Háborúk (+4 támadás gyalogságnak)

source: Berbers
hu_hu: Berberek

source: Cavalry and Naval civilization
hu_hu: Lovas és Tengerész civilizáció

source: Villagers move 10% faster
hu_hu: Parasztok 10%-al gyorsabban mozognak

source: Ships move 10% faster
hu_hu: Hajók 10%-al gyorsabban mozognak

source: Stable units cost -20%
hu_hu: Egységek az istállóból -20%-al olcsóbbak

source: Camel Archers, Genitour
hu_hu: Teveíjász, Lovas dárdavető

source: Kasbah(castles work 25% faster), Maghrabi Camel(camel troops regenerate)
hu_hu: Kasbah (Kastélyok 25% gyorsabban dolgoznak), Maghrabi Teve (Tevék csapatok regenerálódnak)

source: Genitour available in archery range
hu_hu: Genitour elérhető az íjászatban

source: Yeomen (+1 Foot archer range; +2 tower attack), Warwolf(Trebuchets 100% accuracy +0.5 blast radius)
hu_hu: Önkéntesek (+1 gyalog íjász lőtáv, +2 torony lőtáv), Hadifarkas (Trebuchék 100% pontosság és +0.5 robbanó rádiusz)

source: Greek Fire (Fire ships +1 range),Logistica (Cataphracts cause trample damage)
hu_hu: Görögtűz (Gyújtóhajók +1 lőtáv), Logisztika (Kataphraktoszok taposó sérülést okoznak)

source: Stronghold (Castles, towers -20% reload time), Furor Celtica (Siege Workshop Units +50% HP)
hu_hu: Erődítmény (Kastélyok, Tornyok -20% újratöltés), Kelta extázis (Ostromgépek +50% HP)

source: Town Centers +5 LOS
hu_hu: Városközpontok +5 látótáv

source: Great Wall (Walls, gates, towers +30% HP), Rocketry (+2 Chu Ko Nu pierce attack, +4 scorpions)
hu_hu: Nagy Fal (Falak,kapuk,tornyok +30% HP), Rakétatechnika (+2 támadás Chu Ko Nuknak, +4 ballistáknak)

source: Ethiopians
hu_hu: Etiópiaiak

source: Receive 100F 100G upon advancing to next age
hu_hu: 100 Fát és 100 Aranyat kapnak a következő korba való fejlődés után

source: Pikeman and Halberdier upgrades are free
hu_hu: Pikás és Alabárdos fejlesztések ingyenesek

source: Foot archers 15% faster reload
hu_hu: Gyalogíjászok 15%-al gyorsabban lőnek

source: Shotel Warrior
hu_hu: Sotel Harcos

source: Royal Heirs (Shotel warrior created 2x faster), Torsion Engines (+0.45 blast radius for siege workshop units)
hu_hu: Királyi Örökösök (Sotel harcos 2x gyorsabban készül), Torziós Gépek (+0.45 robbanás rádiusz ostromműhelyi gépekgnek)

source: Towers, outposts +3 LOS
hu_hu: Tornyok, Őrszemek +3 látótáv

source: Foragers work 25% faster
hu_hu: Gyűjtögetők 25%-al gyorsabban dolgoznak

source: Chivalry (stables work 40% faster), Bearded Axe (+1 Throwing Axeman range)
hu_hu: Lovagiasság (Istállók 40%-al gyorsabban dolgoznak), Szakállas fejsze (+1 lőtáv Fejszedobálóknak)

source: Infantry cost 35% less (starting in Feudal Age)
hu_hu: Gyalogság 35%-al olcsóbb (Feudális Kortól kezdve)

source: Cavalry Archers cost -10% in Castle Age, -20% in Imperial Age
hu_hu: Lovasíjászokl olcsóbbak -10%-a Kastély és -20%-al Imperiális Korban

source: Marauders (Tarkans available in stables), Atheism (+100 years Wonder/Relic victory time; -50% Spies/Treason cost)
hu_hu: Fosztogatók (Tarkányok elérhetőek az istállóban), Ateizmus (+100 év Csoda/Relikvia győzelmeknél, -50%-al olcsóbb Kémek/Árulás)

source: Incas
hu_hu: Inkák

source: Start with free llama
hu_hu: Ingyenes lámával kezdenek

source: Villagers affected by blacksmith upgrades
hu_hu: Parasztokra is érvényesek a kovácsfejlesztések

source: Houses support 10 population
hu_hu: Hazak 10 egységet szállásolnak el

source: Buildings cost -15% stone
hu_hu: Épületek -15%-al kevesebb kőbe kerülnek

source: Kamayuk, Slinger (Archery Range)
hu_hu: Kamayuk, Parittyás (Íjászat)

source: Andean Sling (skirmishers, slinger no minimum range), Couriers (eagles, kamayuks, slingers +1/+2 armor)
hu_hu: Andok Parittya (dárdavetőknak, parittyásoknak nincs minimum lőtáva), Futárok (Sasharcosok, kamayukok, parittyások +1/+2 védelem)

source: Farms built 50% faster
hu_hu: Farmok 50%-al gyorsabban épülnek

source: Indians
hu_hu: Indiánok

source: Camel and Gunpowder civilization
hu_hu: Teve és Lőpor civilizáció

source: Villagers Cost -10% in Dark, -15% in Feudal, -20% in Castle, -25% in Imperial
hu_hu: Parasztok olcsóbbak -10%-al Sötét, -15%-al Feudális, -20%-al Kastély és -25%-al Imperiális Korban

source: Fishermen(villagers) work 15% faster and carry +15
hu_hu: Halászok (parasztok) 15%-al gyorsaban dolgoznak és +15 húst hordoznak

source: Camels +1/+1 armor
hu_hu: Tevék +1/+1 pajzs

source: Elephant Archer, Imperial Camel (Stable)
hu_hu: Elefántíjász, Imperiális Teve (Istálló)

source: Sultans (gold miners +10% faster, trade units +10% gold, relics +5G/min), Shatagni (hand cannoneers +1 range)
hu_hu: Szultánok (Aranybányászok +10%-al gyorsabban dolgoznak, kereskedők +10% aranyat hoznak, relikviág +5 Arany/perc),<br />Shatagni (Puskások +1 lőtáv)

source: Camels +6 attack vs buildings
hu_hu: Tevék +6 támadás épületek ellen

source: Italians
hu_hu: Olaszok

source: Archer and Naval civilization
hu_hu: Íjász és Tengerész civilizáció

source: Advancing to the next age costs -15%
hu_hu: Fejlődés a következő korba -15%-al olcsóbb

source: Dock techs cost -50%
hu_hu: Kikötő technológiák 25%-al olcsóbbak

source: Fishing ships +2 LOS
hu_hu: Halászhajók +2 tovább látnak

source: Gunpowder units cost -15%
hu_hu: Lőpor egységek -15%-al olcsóbbak

source: Genoese crossbowman, Condottiero(Barracks)
hu_hu: Genovai nyílpuskás, Condottiero (Kaszárnya)

source: Pavise (foot archers +1/+1 armor), Silk road (trade units cost -50%)
hu_hu: Pavese (gyalogíjászok +1/+1 pajzs), Selyemút (kereskedő egységek -50%-al olcsóbbak)

source: Condottiero available in imperial barracks
hu_hu: Condottiero rendelkezésre áll imperiális kaszárnyában

source: Yasama (towers shoot +3 arrows), Kataparuto (Trebuchets fire, pack/unpack faster)
hu_hu: Yasama (Tornyok +3 nyilat lőnek), Kataparuto (Trebuchék töltenek újra és comagolnak szét és össze)

source: Fortifications (walls except gates, castles, towers) are built 25% faster
hu_hu: Erődítmények (falak kapukon kívül, kastélyok, tornyok) 25%-al gyorsabban épülnek

source: Panokseon (turtle ships move 15% faster), Shinkichon (+1 range Mangonels, Onagers)
hu_hu: Panokseon (Teknőshajó 15%-al gyorsabb), Shinkichon

source: Mangonel minimum range 1 (instead of 3)
hu_hu: Mangonel minimum lőtáv 1 (3 helyett)

source: Magyars
hu_hu: Magyarok

source: Villagers kill wolves in 1 strike
hu_hu: Parasztok egy vágással ölnek farkasokat

source: Melee upgrades (forging, iron casting, blast furnace) in blacksmith free (requires blacksmith)
hu_hu: Kard fejlesztések (kovácsolás, vasöntvény, nagyolvasztó kemence) a kovácsnál ingyenes (Kovács épület szükséges)

source: Scout line costs -10%
hu_hu: Felderítő vonal -10%-al olcsóbb

source: Magyar Huszar
hu_hu: Magyar Huszár

source: Mercenaries (Magyar Huszar costs no gold), Recurve bow (Cavalry archers +1 range)
hu_hu: Zsoldosok (Magyar Huszár nem kerül aranyba), Reflexíj (Lovasíjászok +1 lőtáv)

source: Foot archers (not skirmishers) +2 LOS
hu_hu: Gyalogíjászok (dárdavetőkön kívül) +2 látótáv

source: Malians
hu_hu: Maliaiak

source: Barracks units get +1 pierce armor per age
hu_hu: Kaszárnya egységeg +1 szúrópajzsot kapnak minden korban

source: Buildings, farms wood cost -15%
hu_hu: Épületek, farmok -15%-al kevesebb fába kerülnek

source: Gold mining upgrades free
hu_hu: Aranybányábani fejlesztések ingyenesek

source: Tigui (TC fire arrows without garrisoned villagers), Farimba (Cavalry, camels +5 attack)
hu_hu: Tigui (Városközpont nyilakat lő parasztok nélkül), Farimba (Lovasság, Tevék +5 támadás)

source: University operates 80% faster
hu_hu: Egyetemek 80%-al gyorsabban fejlesztenek

source: Obsidian Arrow (archer line +6 attack vs buildings), El Dorado (+40 Eagle Warrior HP)
hu_hu: Obszidián nyíl (íjász vonal +6 támadás épületek ellen), Eldorádó (+40 HP Sasharcosoknak)

source: Nomads (destroyed houses don't loose population room), Drill (Siege Workshop units move 50% faster)
hu_hu: Nomádok (elpusztított házak nem vesztik el szállásoló terüket), Fúró (Ostrom műhelyből való gépek 50%-al gyorsabbak)

source: Boiling Oil (Castles +9 attack vs rams), Mahouts (+30% War Elephant speed)
hu_hu: Forró Olaj (Kastélyok +9 támadás faltörők ellen), Elefánthajcsárok (+30%-al gyorsabb elefántok)

source: Portuguese
hu_hu: Portugál

source: Naval and Gunpowder civilization
hu_hu: Tengerész és Lőpor civilizáció

source: All units cost -15% gold
hu_hu: Minden egység -15%-al olcsóbb

source: All ships +10% HP
hu_hu: Minden hajónak +10% HP

source: Get Feitoria
hu_hu: Feitoria elérhető

source: Organ Gun, Caravel (dock)
hu_hu: Orgonapuskásk, Karavella (Kikötő)

source: Carrack (ships +1/+1 armor), Arquebus (gunpowder units affected by ballistics)
hu_hu: Karakk (hajók +1/+1 pajzs), Szakállas puska (lőpor egységekre hat a ballisztika)

source: Free cartography from Dark Age
hu_hu: Térképészet Sötét Kortól érvényben van

source: Market costs -75 wood
hu_hu: Piac -75 Fával olcsóbb

source: Madrasah (monks return 33% of their cost), Zealotry (+30 camel, Mameluke HP)
hu_hu: Medresze (papok halálakor áruk 33% százalékat visszakapod), Fanatizmus (+30 teve és mameluk HP)

source: Slavs
hu_hu: Szlávok

source: Infantry and siege civilization
hu_hu: Gyalogság és Ostromgép civilizáció

source: Farmers work ~15% faster without upgrades
hu_hu: Farmerek 15%-al gyorsabban dolgoznak technológiák nélkül

source: Tracking free
hu_hu: Követés ingyenes

source: Siege units from siege workshop 15% cheaper
hu_hu: Ostromgepek az ostromműhelyből 15%-al olcsóbbak
